Vitech-UA/STM32_RFM69_Comunication/STM32F030_RFM69_Cpp_Transmitter/Src/main.cpp
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stm32f0xx.h>
#include <stdio.h>
#include "Gpio.h"
#include "SPI.h"
#include "main.h"
#include "RFM69.h"

volatile uint32_t uptime_ms = 0;

uint8_t ReceiveRegValue = 0;
uint8_t Temperature = 0;
int32_t freq = 0;
char UART_BUFFER[30];
int bytesReceived = 0;
int main(void) {

	mstimer_init();
	RFM69 Modem = RFM69(SPI1, GPIOA, 3, false, DataSize_8B);
	Modem.setFrequency(868000000);

	Modem.SetResetPin(GPIOA, 4);

	Modem.writeRegister(REG_BITRATEMSB, 0x68);//1.2 kbps
	Modem.writeRegister(REG_BITRATELSB, 0x2B);
	Modem.setFrequency(915000000);
	Modem.reset();
	Modem.init();
	Modem.sleep();
	Modem.setPowerDBm(13);
	Modem.setCSMA(true);

	char testdata[] = { 'H', 'e', 'l', 'l', 'o' };

	while (1) {

		Modem.send(testdata, 5);
		Modem.sleep();
		delay_ms(500);
	}
}

extern "C" void SysTick_Handler() {
	uptime_ms++;
}

/** Wait for X milliseconds.
 *
 * @param ms Milliseconds
 */
void delay_ms(unsigned ms) {
	uint32_t start = uptime_ms;
	while (uptime_ms - start < ms)
		;
}

/** Initialize the millisecond timer. */
void mstimer_init(void) {
	SysTick_Config(SystemCoreClock / 1000);
}

/** Return the number of milliseconds since start.
 *
 * @return Milliseconds
 */
uint32_t mstimer_get(void) {
	return uptime_ms;
}
